# creating Pandas DataFrame

In [1]:
# constructor pd.DataFrame(data, index, columns, dtype,copy)

# creating Empty DataFrame

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame()

In [4]:
df

Empty DataFrame
Columns: []
Index: []

# creating DataFrame from list

In [5]:
df1=pd.DataFrame([1,2,3,4,5,6])

In [6]:
df1

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [7]:
df.dtypes

Series([], dtype: object)

In [8]:
df1=pd.DataFrame([["Akash",1],["Babalu",2],["Caterina",3]])

In [9]:
df1

          0  1
0     Akash  1
1    Babalu  2
2  Caterina  3

In [10]:
#adding column name asn index
df1=pd.DataFrame([["Akash",1],["Babalu",2],["Caterina",3]],columns=["Name","Roll_No"])

In [11]:
df1

       Name  Roll_No
0     Akash        1
1    Babalu        2
2  Caterina        3

In [12]:
df1.set_index("Roll_No") #column Roll_No set as index temporary change

             Name
Roll_No
1           Akash
2          Babalu
3        Caterina

In [13]:
df1 #not changed use inplace for permanent Change in dataframe with set index

       Name  Roll_No
0     Akash        1
1    Babalu        2
2  Caterina        3

# Creating DataFrame form Dictionary of List

In [14]:
dict1={"Name":["Akash","Ayush","Rakesh"],"Roll_No":[1,2,3]}

In [15]:
dict1

{'Name': ['Akash', 'Ayush', 'Rakesh'], 'Roll_No': [1, 2, 3]}

In [16]:
#changing index data frame permamnet change change

In [17]:
df1=pd.DataFrame(dict1,index=["Rank"+str(i) for i in range(len(dict1["Name"]))])

In [18]:
df1

         Name  Roll_No
Rank0   Akash        1
Rank1   Ayush        2
Rank2  Rakesh        3

In [19]:
#create index in dataframe
for x,y in dict1.items():
    print(x,y)
len(dict1["Name"])

Name ['Akash', 'Ayush', 'Rakesh']
Roll_No [1, 2, 3]

3

In [20]:
df1

         Name  Roll_No
Rank0   Akash        1
Rank1   Ayush        2
Rank2  Rakesh        3

In [21]:
#another way
df1=pd.DataFrame(dict1,index=["Rank0","Rank1","Rank2"])

In [22]:
df1

         Name  Roll_No
Rank0   Akash        1
Rank1   Ayush        2
Rank2  Rakesh        3

In [23]:
#Create DataFrame from list of dictionary

In [24]:
#another way
rankindex=["Rank0","Rank1","Rank2"]
df1=pd.DataFrame(dict1,index=rankindex)

In [25]:
df1

         Name  Roll_No
Rank0   Akash        1
Rank1   Ayush        2
Rank2  Rakesh        3

# Create DataFrame from list of dictionary

In [26]:
list1=[{"a":1,"b":2},{"a":3,"b":4},{"a":5,"b":6,"c":7}]

In [27]:
list1

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}, {'a': 5, 'b': 6, 'c': 7}]

In [28]:
df3=pd.DataFrame(data=list1)

In [29]:
df3

   a  b    c
0  1  2  NaN
1  3  4  NaN
2  5  6  7.0

In [30]:
df3.dtypes

a      int64
b      int64
c    float64
dtype: object

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       1 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 200.0 bytes

# Creating dataframe from dict of series

In [32]:
dict_of_series={"one":pd.Series([1,2,3,4],index=["a","b","c","d"]),
                "two":pd.Series([5,6,7,8,9],index=["a","b","c","d","e"])}

In [33]:
dict_of_series

{'one': a    1
 b    2
 c    3
 d    4
 dtype: int64,
 'two': a    5
 b    6
 c    7
 d    8
 e    9
 dtype: int64}

In [34]:
df4=pd.DataFrame(data=dict_of_series)

In [35]:
df4

   one  two
a  1.0    5
b  2.0    6
c  3.0    7
d  4.0    8
e  NaN    9